Revit 2027 API
Category.CategoryType Property
 Gets the category type of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CategoryType CategoryType { get; }
Public ReadOnly Property CategoryType As CategoryType
	Get
public:
property CategoryType CategoryType {
	CategoryType get ();
}
member CategoryType : CategoryType with get
Property Value
CategoryType
Remarks
 The category type determines if the category is shown in the Visibility/Graphics settings grouped with the model,annotation, or analytical model categories. Note that import categories are also "model" but will be shown separately in the dialog. Some categories not shown in the dialog and will return Internal for the category type.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace